graphite-server/internal/analysis/c4/testdata/artifact-families/all.plantuml
' Context
@startuml
top to bottom direction
skinparam shadowing false
actor "HTTP Clients" as person_http_clients
package "Application Layer" {
  rectangle "Checkout" as system_application
}
package "External Systems" {
  component "payment" as dependency_namespace_com_partner_payment
}
package "Library Layer" {
  component "Lucene" as dependency_library_lucene
  component "Commons" as dependency_library_commons
  component "Postgresql" as dependency_artifact_postgresql_42_7_3
  component "Alpha LIB" as dependency_artifact_alpha_lib_1_0
  component "Zeta LIB" as dependency_artifact_zeta_lib_1_0
  component "Commons Lang3" as dependency_artifact_commons_lang3_3_14_0
}
package "Technology Layer" {
  node "Java Runtime" as dependency_runtime_java
}
dependency_library_lucene --> dependency_library_commons : builds on
system_application --> dependency_library_lucene : uses
dependency_library_commons --> dependency_artifact_postgresql_42_7_3 : builds on
dependency_artifact_alpha_lib_1_0 --> dependency_artifact_postgresql_42_7_3 : builds on
dependency_artifact_zeta_lib_1_0 --> dependency_library_lucene : builds on
system_application --> dependency_artifact_alpha_lib_1_0 : uses
system_application --> dependency_artifact_zeta_lib_1_0 : uses
system_application --> dependency_namespace_com_partner_payment : uses
person_http_clients --> system_application : uses
dependency_artifact_postgresql_42_7_3 --> dependency_runtime_java : runs on
dependency_artifact_commons_lang3_3_14_0 --> dependency_runtime_java : runs on
@enduml

' Container
@startuml
top to bottom direction
skinparam shadowing false
package "Application Layer" {
  package "Runtime Boundary" {
    component "Checkout Runtime" as container_application_runtime
  }
}
package "External Systems" {
  component "payment" as dependency_namespace_com_partner_payment
}
container_application_runtime --> dependency_namespace_com_partner_payment : uses
@enduml

' Component
@startuml
top to bottom direction
skinparam shadowing false
package "Application Layer" {
  package "Checkout Runtime" {
    component "Service and Repository" as component_service_and_repository
    component "Api" as component_api
  }
}
component_api --> component_service_and_repository : routes to
@enduml
